tsung-tests/AddVolunteerFormOnly.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="targetmachine" port="80" type="tcp"></server>
</servers>

  <monitoring>
    <monitor host="targetmachine" type="snmp"></monitor>
  </monitoring>

 <load duration="62" unit="minute">
   <arrivalphase phase="1" duration="1" unit="minute">
     <users maxnumber="25" arrivalrate="1" unit="second"></users>
   </arrivalphase>
    <arrivalphase phase="2" duration="3" unit="minute">
     <users maxnumber="50" arrivalrate="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="3" duration="6" unit="minute">
     <users maxnumber="100" arrivalrate="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="4" duration="12" unit="minute">
     <users maxnumber="200" arrivalrate="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="36" unit="minute">
     <users maxnumber="400" arrivalrate="2" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
     <option name="file_server" id='newvolunteers' value="volunteers.csv"/>
     <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>
  


<sessions>
<session name='add-volunteer' probability='100'  type='ts_http'>

<request><http url='http://targetmachine/eden' version='1.1' method='GET'></http></request>

<transaction name="login">

<!-- Visit Login page -->
        <request>
            <!-- Collect the formkey from the registration form (not the sign-in form!) -->
            <dyn_variable name="_formkey" xpath="//input[@name='_formkey'][1]/@value" />
            <http url="/eden/default/user/login" method="GET" version="1.1"></http>
        </request>
        <request subst="true">  <!-- Hard coded to login as admin@example.com -->
            <http url="/eden/default/user/login" method="POST" version="1.1" content_type='application/x-www-form-urlencoded' contents="_formname=login&amp;_formkey=%%__formkey%%&amp;email=admin@example.com&amp;password=testing&amp;_next=/eden/default/index&amp;_utc_offset=-330">
            </http>
        </request>
</transaction>

<!-- New Volunteers get added here -->
<transaction name="get_volunteer_form">

<request>
            <!-- Collect the formkey from the registration form (not the sign-in form!) -->
    <dyn_variable name="_formkey" xpath="//input[@name='_formkey'][1]/@value" />
    <http url="/eden/vol/volunteer/create" method="GET" version="1.1"></http>
</request>
</transaction>

<transaction name="add_volunteer">

        <!-- fetch volunteer data -->
        <setdynvars sourcetype="file" fileid="newvolunteers" delimiter="," order="iter">
            <var name="organisation_id"/>
			<var name="person_id"/>
			<var name="first_name"/>
			<var name="middle_name"/>
			<var name="last_name"/>
			<var name="date_of_birth"/>
			<var name="gender"/>
			<var name="email"/>
			<var name="mobile_phone"/>
			<var name="programme_id"/>
			<var name="job_title_id"/>
			<var name="start_date"/>
			<var name="end_date"/>
			<var name="location_id"/>
			<var name="gis_location_L0"/>
			<var name="gis_location_name"/>
			<var name="gis_location_street"/>
			<var name="gis_location_postcode"/>
			<var name="gis_location_L1"/>
			<var name="gis_location_L2"/>
			<var name="gis_location_L3"/>
			<var name="gis_location_L4"/>
			<var name="gis_location_lat"/>
			<var name="gis_location_lon"/>
			<var name="utc_offset"/>
        </setdynvars>
        
 <request subst="true">       
<http url='/eden/vol/volunteer/create' version='1.1' content_type='application/x-www-form-urlencoded' method='POST' contents='_formkey=%%__formkey%%&amp;organisation_id=%%_organisation_id%%&amp;first_name=%%_first_name%%&amp;middle_name=%%_middle_name%%&amp;last_name=%%_last_name%%&amp;date_of_birth=%%_date_of_birth%%&amp;gender=%%_gender%%&amp;email=%%_email%%&amp;mobile_phone=%%_mobile_phone%%&amp;programme_id=%%_programme_id%%&amp;job_title_id=%%_job_title_id%%&amp;start_date=%%_start_date%%&amp;end_date=%%_end_date%%&amp;location_id=%%_location_id%%&amp;gis_location_L0=%%_gis_location_L0%%&amp;gis_location_name=%%_gis_location_name%%&amp;gis_location_street=%%_gis_location_street%%&amp;gis_location_postcode=%%_gis_location_postcode%%&amp;gis_location_L1=%%_gis_location_L1%%&amp;gis_location_L2=%%_gis_location_L2%%&amp;gis_location_L3=%%_gis_location_L3%%&amp;gis_location_L4=%%_gis_location_L4%%&amp;gis_location_lat=%%_gis_location_lat%%&amp;gis_location_lon=%%_gis_location_lon%%&amp;_formname=hrm_human_resource/None%%&amp;_utc_offset=%%_utc_offset%%'>

</http>
</request>
</transaction>

</session>

</sessions>
</tsung>